zc110747/embedded_based_on_stm32/code/26-2-STM32F429_ModbusOS/port/porttimer.c
/*
 * FreeModbus Libary: LPC214X Port
 * Copyright (C) 2007 Tiago Prado Lone <tiago@maxwellbohr.com.br>
 *
 * This library is free software; you can redistribute it and/or
 * modify it under the terms of the GNU Lesser General Public
 * License as published by the Free Software Foundation; either
 * version 2.1 of the License, or (at your option) any later version.
 *
 * This library is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
 * Lesser General Public License for more details.
 *
 * You should have received a copy of the GNU Lesser General Public
 * License along with this library; if not, write to the Free Software
 * Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA
 *
 * File: $Id$
 */

/* ----------------------- Platform includes --------------------------------*/
#include "stm32f4xx_hal.h"
#include "port.h"

/* ----------------------- Modbus includes ----------------------------------*/
#include "mb.h"
#include "mbport.h"
#include "cmsis_os.h"
#include "timers.h"

/* ----------------------- static functions ---------------------------------*/
#define USE_OS_SOFT_TIMER 1

/* ----------------------- Start implementation -----------------------------*/
#if USE_OS_SOFT_TIMER == 1
static TimerHandle_t xTimer;

void vTimerCallback( TimerHandle_t xTimer )
{
    EnterCriticalSection();
    ( void )pxMBPortCBTimerExpired(  );
    ExitCriticalSection();
}

BOOL
xMBPortTimersInit( USHORT usTim1Timerout50us )
{
    xTimer = xTimerCreate("Timer", 
        (50 * usTim1Timerout50us)/(1000 * 1000 / configTICK_RATE_HZ) + 4,
         pdFALSE,
         ( void * ) 0,
         vTimerCallback
       );
         
    if (xTimer) {
        return TRUE;
    }
    return FALSE;
}  

void
vMBPortTimersEnable(  )
{
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;
    
    if(IS_IRQ()) {
        xTimerResetFromISR(xTimer, &xHigherPriorityTaskWoken);
        xTimerStartFromISR( xTimer, &xHigherPriorityTaskWoken);
    }
    else {
        xTimerReset(xTimer, 0);
        xTimerStart(xTimer, 0);
    }
}

void
vMBPortTimersDisable(  )
{
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;
    
    if(IS_IRQ()) {
        xTimerStopFromISR(xTimer, &xHigherPriorityTaskWoken);
    }
    else {
        xTimerStop(xTimer, 0);
    }
}

#else
static TIM_HandleTypeDef htim1;

BOOL
xMBPortTimersInit( USHORT usTim1Timerout50us )
{      
    TIM_ClockConfigTypeDef sClockSourceConfig = {0};
    TIM_MasterConfigTypeDef sMasterConfig = {0};

    __HAL_RCC_TIM1_CLK_ENABLE();

    htim1.Instance = TIM1;
    htim1.Init.Prescaler = 4500;      //分频, 实际时钟为TimerClk/(prescaler+1), 以90M为例则为20K, 50us
    htim1.Init.CounterMode = TIM_COUNTERMODE_UP;
    htim1.Init.Period = usTim1Timerout50us;      
    htim1.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
    htim1.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_ENABLE;
    if (HAL_TIM_Base_Init(&htim1) != HAL_OK)
    {
        return FALSE;
    }
    
    sClockSourceConfig.ClockSource = TIM_CLOCKSOURCE_INTERNAL;
    if (HAL_TIM_ConfigClockSource(&htim1, &sClockSourceConfig) != HAL_OK)
    {
        return FALSE;
    }

    sMasterConfig.MasterOutputTrigger = TIM_TRGO_RESET;
    sMasterConfig.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
    if (HAL_TIMEx_MasterConfigSynchronization(&htim1, &sMasterConfig) != HAL_OK)
    {
        return FALSE;
    }

    HAL_NVIC_SetPriority(TIM1_UP_TIM10_IRQn, 0, 0);
    HAL_NVIC_EnableIRQ(TIM1_UP_TIM10_IRQn);
    
    return TRUE;
}


void
vMBPortTimersEnable(  )
{
    __HAL_TIM_SetCounter(&htim1, 0);
    HAL_TIM_Base_Start_IT(&htim1);
}

void
vMBPortTimersDisable(  )
{
    HAL_TIM_Base_Stop_IT(&htim1);
}

void TIM1_UP_TIM10_IRQHandler(void)
{
    if (__HAL_TIM_GET_FLAG(&htim1, TIM_FLAG_UPDATE) != RESET)
    {
        __HAL_TIM_CLEAR_IT(&htim1, TIM_IT_UPDATE);
        
        ( void )pxMBPortCBTimerExpired(  );
    }
}
#endif
